000100181007             PGM
000101181007
000102181007             CALL       STRJOB
000103181031             ADDLIBLE   SENECAPAY
000104181007             ADDLIBLE   BCI433LIB
000105181114             ADDLIBLE   MCU1D11
000106181007             MONMSG     MSGID(CPF2103)
000107181007             DSPSYSLVL  OUTPUT(*DISPLAY)
000108181007
000109181007             ENDPGM
000110181007
000111181015                                                                                 .
