000100180909/**********************************************/
000200180909/**** SYSVALPRG - DISPLAY SYSTEMS VALUE       */
000300180909/**********************************************/
000400180909
000500180909PGM
000600180909   DSPLIBL
000700180909   EDTLIBL
000800180909   DSPLIBL
000900180909   DSPSYSVAL QSYSLIBL
001000180909   DSPSYSVAL QUSRLIBL
001100180909   DSPSYSVAL QMODEL
001200180909ENDPGM
