000100181204        DCL-PR DayOfWeek ZONED(1);
000101181204                AnyDate Date;
000102181204        END-PR;
000103181204
000104181205        DCL-PR DayName CHAR(9);
000105181204                AnyDate Date;
000106181204        END-PR;
000107181204
000108181205        DCL-PR DateWords CHAR(30);
000109181204                AnyDate Date;
000110181204        END-PR;
000111181204
000112181204
000113181204
