000100181204        CTL-OPT DatFMT(*USA);
000101181204        DCL-F WHATDAYDSP WORKSTN;
000102181204        /COPY LAB10,DATEPROTOS
000103181204        DCL-S WorkDate Date;
000104181204        Exfmt INPUT;
000105181204
000106181204        DOW NOT *IN03;
000107181204          WorkDate = DATEIN;
000108181205          RESULT1 = 'THE DAY OF WEEK IS ' +%CHAR(DayOfWeek(WorkDate));
000109181205          RESULT2 = 'THAT''S A ' + DayName(WorkDate);
000110181204          RESULT3 = DateWords(WorkDate);
000111181204
000112181204          *IN90 = *ON;
000113181204          WRITE INPUT;
000114181204          EXFMT OUTPUT;
000115181204          *IN90 = *OFF;
000116181204
000117181204          IF NOT *IN03;
000118181204          EXFMT INPUT;
000119181204
000120181204          ENDIF;
000121181204        ENDDO;
000122181204        RETURN;
000123181204
000124181204
