000100181204     A          R OUTPUT                    CF03(03)
000101181204     A                                      OVERLAY
000102181204     A            RESULT1       30   O 11 19
000103181204     A            RESULT2       30   O 12 19
000104181204     A            RESULT3       30   O 13 19
000105181204     A                                 16 15'F3 - Exit'
000106181204     A          R INPUT
000107181204     A            DATEIN          L  B  4 37
000108181204     A  90                                  DSPATR(PR)
000109181204     A                                  4 22'Enter a Date:'
000110181204     A                                  4 50'yyyy-mm-dd'
000111181204     A                                  1 21'D a y   O f   W e e k   F u n c t -
000112181204     A                                      i o n'
000113181204     A                                  1  4USER
000114181204     A                                  1 72DATE
000115181204     A                                      EDTCDE(Y)
000116181204
000117181204
