000001181009     DADJUSTHOUR       S              2B 0
000100181008     FHWYTOLLDSPCF   E             WORKSTN
000101180923     F/FREE
000102181009
000103180923         EXFMT TOLLINFO;
000104180923               DOW NOT(*IN03);
000105180923                 EXSR SetTollRate;
000106180923                 *IN99 =  *ON;
000107180923                 WRITE TOLLINFO;
000108180923                 EXFMT SHOWTOLL;
000109180923                 *IN99  = *OFF;
000110180923                 IF *IN99 = *OFF;
000111180923                    EXSR CLEAR;
000112180923                    EXFMT TOLLINFO;
000113180923                 ENDIF;
000114180923               ENDDO;
000115180923          *INLR = *ON;
000116180923          RETURN;
000117180923
000118180923        BEGSR SetTollRate;
000119180930          EXSR ADJUSTTIME;
000120180930          SELECT;
000121181009            WHEN ADJUSTHOUR>=19 OR ADJUSTHOUR<=5;
000122180930              SELECT;
000123180930                WHEN VEHICLE ='L';
000124180930                   TOLLRATE= .2062;
000125180930                WHEN VEHICLE='H';
000126180930                   TOLLRATE = .4224;
000127180930                WHEN VEHICLE = 'M';
000128180930                   TOLLRATE = .6586;
000129180930              ENDSL;
000130180930
000131181009              WHEN ADJUSTHOUR  <9;
000132180930                 SELECT;
000133180930                   WHEN VEHICLE ='L';
000134180930                     TOLLRATE= .3507;
000135180930                   WHEN VEHICLE='H';
000136180930                     TOLLRATE = .7218;
000137180930                   WHEN VEHICLE = 'M';
000138180930                     TOLLRATE = 1.1222;
000139180930                 ENDSL;
000140180930
000141181009               WHEN ADJUSTHOUR  <10;
000142180930                 SELECT;
000143180930                   WHEN VEHICLE ='L';
000144180930                     TOLLRATE= .3359;
000145180930                   WHEN VEHICLE='H';
000146180930                     TOLLRATE = .6418;
000147180930                   WHEN VEHICLE = 'M';
000148180930                     TOLLRATE = .9978;
000149180930                ENDSL;
000150180930
000151181009                WHEN ADJUSTHOUR  <16;
000152180930                 SELECT;
000153180930                   WHEN VEHICLE ='L';
000154180930                     TOLLRATE= .2733;
000155180930                   WHEN VEHICLE='H';
000156180930                     TOLLRATE = .5566;
000157180930                   WHEN VEHICLE = 'M';
000158180930                     TOLLRATE = .8699;
000159180930                ENDSL;
000160180930
000161181009                WHEN ADJUSTHOUR  <19;
000162180930                 SELECT;
000163180930                   WHEN VEHICLE ='L';
000164180930                     TOLLRATE= .3942;
000165180930                   WHEN VEHICLE='H';
000166180930                     TOLLRATE = .7383;
000167180930                   WHEN VEHICLE = 'M';
000168180930                     TOLLRATE = 1.1625;
000169180930                ENDSL;
000170180930
000171180930          ENDSL;
000172180930
000173180930          TOLLCHARGE = KILOMETRES * TOLLRATE;
000174180930
000175180930          IF TRANSPDR ='N';
000176180930            NOTRANSP = 4.07;
000177180930          ELSE;
000178180930            NOTRANSP = 0;
000179180930          ENDIF;
000180180930
000181180930          TOTALDUE = TOLLCHARGE + NOTRANSP;
000182180923        ENDSR;
000183180923
000184181009        BEGSR CLEAR;
000185180923          KILOMETRES = 0;
000186180923          VEHICLE = '';
000187180923          HOUR = 0;
000188180923          AMPM = '';
000189180923          TRANSPDR ='';
000190180923        ENDSR;
000191180930
000192180930        BEGSR ADJUSTTIME;
000193181009
000194180930          IF AMPM ='PM';
000195180930            IF HOUR <> 12;
000196181009             ADJUSTHOUR =HOUR + 12;
000197180930              ELSE;
000198181009                ADJUSTHOUR =HOUR;
000199180930            ENDIF;
000200180930
000201180930            ELSE;
000202181009                IF HOUR<>12 ;
000203181009
000204181009                ADJUSTHOUR =HOUR;
000205181009
000206181009              else;
000207181009                adjusthour = 0     ;
000208181009
000209181009
000210181009
000211180930              ENDIF;
000212180930          ENDIF;
000213180930        ENDSR;
